setTimeout(() => console.log('Hello, World!'), 0);

// числа фибоначи начинаются с 0, 1, 1, 2, 3, 5, 8, 13, 21, 34 и так далее
// n-ое число фибоначи равно сумме двух предыдущих чисел
// 0,1,2,3,4,5,6,7,8,9,10 = 55

function fib(n) {
  if (n === 0 || n === 1) {
    return n; // 0 и 1 - это первые два числа фибоначи - они возвращаются как есть
  }
  // иначе мы должны вернуть сумму двух предыдущих чисел фибоначи
  return fib(n - 1) + fib(n - 2);
}

console.log(fib(40))

// console.log(fib(10000)); // это вызовет ошибку "Maximum call stack size exceeded", так как рекурсия слишком глубока - мы превысли максимальную глубину стека вызовов, которая может быть обработана JavaScript-движком.

// недостаток этой фукции в том, что она блокирует цикл событий (event loop), так как она выполняется синхронно и не позволяет другим операциям выполняться, пока она не завершится. Это может привести к тому, что пользовательский интерфейс будет заморожен и не будет реагировать на действия пользователя, пока функция не завершится. Поэтому для вычисления больших чисел фибоначи лучше использовать итеративный подход или мемоизацию, чтобы избежать блокировки цикла событий.
