setTimeout(() => console.log('Hello, World!'), 0);

function fib(n) {
  return new Promise((resolve, reject) => {
    if (n === 0 || n === 1) {
      return resolve(n);
    }

    setImmediate(
      () =>
        Promise.all([fib(n - 1), fib(n - 2)]).then(([fib1, fib2]) =>
          resolve(fib1 + fib2),
        ),
      // fib1, fib2 - это два предыдущих числа в последовательности Фибоначчи, которые мы складываем и возвращаем как результат для текущего n
    );
  });
}

fib(10).then((result) => console.log(`${result}`));

// теперь мы видим, что сначала выводится "Hello, World!", а затем результат вычисления 10-го числа Фибоначчи.
// Это происходит потому, что setTimeout и setImmediate позволяют нам отложить выполнение кода, не блокируя основной поток выполнения.
// в итоге цикл событий не блокируется, и мы можем выполнять другие задачи, пока вычисление Фибоначчи происходит асинхронно.
