console.log('Program start');

setTimeout(() => {
  console.log('Timeout 1');
}, 0);

setTimeout(() => {
  console.log('Timeout 2');
}, 10);

// эта коллбек функция будет выполнена только тогда, когда промис успешно выполнен
// эта функция будет вызвана практически сразу после того, как текущий код завершится, но до того, как будет выполнен коллбек из setTimeout
// это гооворит о том, что промисы имеют более высокий приоритет в очереди событий, чем setTimeout
// есть 4 типа очередей: microtasks (промисы), macrotasks (setTimeout, setInterval), rendering (отрисовка страницы) и I/O (ввод-вывод)
// microtasks выполняются до macrotasks, поэтому промисы будут выполнены до коллбеков из setTimeout, даже если время задержки равно 0
// это демонстрирует, что даже если setTimeout имеет нулевую задержку, он все равно будет выполнен после промиса, потому что промисы имеют более высокий приоритет в очереди событий
// это означает, что коллбек из setTimeout будет выполнен только после того, как все промисы, которые были созданы до него, будут выполнены
// это важно понимать, потому что это может повлиять на порядок выполнения кода и может привести к неожиданным результатам, если не учитывать приоритеты в очереди событий
Promise.resolve().then(() => {
  console.log('Promise 1');
});

console.log('Program end');
